# Pandas
* Filtering 
* Sorting
* Use full methods
* groupby
* merge

In [4]:
import pandas as pd
from datetime import datetime
# Create a dictionary with the extended data
data = {
    'Roll No': list(range(1, 21)),
    'Name': [
        'Alice Smith', 'Bob Johnson', 'Carol Davis', 'Dave Wilson', 'Emma Brown', 
        'Frank Clark', 'Grace Lewis', 'Henry Walker', 'Ivy Hall', 'Jack Turner',
        'Kelly Adams', 'Liam Roberts', 'Mia Thompson', 'Noah Martinez', 'Olivia Harris',
        'Peter King', 'Quinn Scott', 'Rachel Lewis', 'Samuel Clark', 'Tina Young'
    ],
    'Father': [
        'John Smith', 'Michael Johnson', 'Robert Davis', 'Richard Wilson', 'William Brown', 
        'James Clark', 'David Lewis', 'Thomas Walker', 'Charles Hall', 'Steven Turner',
        'Brian Adams', 'Alan Roberts', 'Laura Thompson', 'Daniel Martinez', 'George Harris',
        'Paul King', 'Steve Scott', 'Bruce Lewis', 'Edward Clark', 'Roger Young'
    ],
    'Course': [
        'Computer Science', 'Mechanical Engineering', 'Electrical Engineering', 'Civil Engineering', 'Chemical Engineering', 
        'Biotechnology', 'Mathematics', 'Physics', 'Statistics', 'Data Science',
        'Information Technology', 'Mechanical Engineering', 'Civil Engineering', 'Electrical Engineering', 'Biotechnology',
        'Computer Science', 'Chemical Engineering', 'Mathematics', 'Physics', 'Data Science'
    ],
    'Date of Admission': [
        '2024-01-15', '2024-02-20', '2024-03-10', '2024-04-05', '2024-05-12', 
        '2024-06-15', '2024-07-20', '2024-08-18', '2024-09-14', '2024-10-22',
        '2024-11-05', '2024-12-01', '2024-01-10', '2024-02-14', '2024-03-20',
        '2024-04-25', '2024-05-30', '2024-06-28', '2024-07-12', '2024-08-23'
    ],
    'Fee': [
        1200, 1300, 1100, 1250, 1400, 
        1150, 1050, 1250, 1100, 1350,
        1250, 1300, 1200, 1150, 1100,
        1400, 1300, 1050, 1200, 1250
    ]
}

# Create DataFrame
df = pd.DataFrame(data)

# Convert 'Date of Admission' to datetime
df['Date of Admission'] = pd.to_datetime(df['Date of Admission'])

# Display the DataFrame
print(df)

    Roll No           Name           Father                  Course  \
0         1    Alice Smith       John Smith        Computer Science
1         2    Bob Johnson  Michael Johnson  Mechanical Engineering
2         3    Carol Davis     Robert Davis  Electrical Engineering
3         4    Dave Wilson   Richard Wilson       Civil Engineering
4         5     Emma Brown    William Brown    Chemical Engineering
5         6    Frank Clark      James Clark           Biotechnology
6         7    Grace Lewis      David Lewis             Mathematics
7         8   Henry Walker    Thomas Walker                 Physics
8         9       Ivy Hall     Charles Hall              Statistics
9        10    Jack Turner    Steven Turner            Data Science
10       11    Kelly Adams      Brian Adams  Information Technology
11       12   Liam Roberts     Alan Roberts  Mechanical Engineering
12       13   Mia Thompson   Laura Thompson       Civil Engineering
13       14  Noah Martinez  Daniel Martinez  Electrical Engineering
14       15  Olivia Harris    George Harris           Biotechnology
15       16     Peter King        Paul King        Computer Science
16       17    Quinn Scott      Steve Scott    Chemical Engineering
17       18   Rachel Lewis      Bruce Lewis             Mathematics
18       19   Samuel Clark     Edward Clark                 Physics
19       20     Tina Young      Roger Young            Data Science

   Date of Admission   Fee
0         2024-01-15  1200
1         2024-02-20  1300
2         2024-03-10  1100
3         2024-04-05  1250
4         2024-05-12  1400
5         2024-06-15  1150
6         2024-07-20  1050
7         2024-08-18  1250
8         2024-09-14  1100
9         2024-10-22  1350
10        2024-11-05  1250
11        2024-12-01  1300
12        2024-01-10  1200
13        2024-02-14  1150
14        2024-03-20  1100
15        2024-04-25  1400
16        2024-05-30  1300
17        2024-06-28  1050
18        2024-07-12  1200
19        2024-08-23  1250

In [105]:
import pandera as pa
from pandera.typing import DataFrame, Series
from datetime import datetime
import pandas as pd

# Define the schema using DataFrameSchema
schema = pa.DataFrameSchema({
    'roll_no': pa.Column(pa.Int, checks=pa.Check.ge(1)),
    'name': pa.Column(pa.String, nullable=False),
    'father': pa.Column(pa.String, nullable=False),
    'course': pa.Column(pa.String, nullable=False),
    'date_of_admission': pa.Column(pa.DateTime, checks=pa.Check.le(datetime.now())),
    'fee': pa.Column(pa.Int, checks=pa.Check.ge(0))
})

# Data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'computer', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Validate the DataFrame
validated_df = schema.validate(students_df)

print(validated_df)

TypeError: 'Series' object is not callable

# Applying the filter or filter function on dataframe

In [19]:
students_df.head(1)

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [22]:
students_df.course.value_counts()

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
computer     1
Name: count, dtype: int64

In [23]:
# if some course is empty or None
students_df.course.value_counts(dropna=False) # also counts null cells value

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
computer     1
Name: count, dtype: int64

In [71]:
students_df.course.value_counts(dropna=False,normalize=True)

course
Physics      0.3
Chemistry    0.1
Biology      0.1
Economics    0.1
History      0.1
Geography    0.1
English      0.1
computer     0.1
Name: proportion, dtype: float64

In [57]:
students_df.course.value_counts(dropna=False,normalize=True)*100

course
Physics      300
Chemistry    100
Biology      100
Economics    100
History      100
Geography    100
English      100
computer     100
Name: count, dtype: int64

In [26]:
students_df

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah   computer        2023-10-05  19000

In [44]:
import pandas as pd
import random
from datetime import datetime

# Parameters for generating transaction data
num_transactions = 1000
start_date = datetime(2023, 1, 1)
end_date = datetime(2024, 1, 1)

# Function to generate random dates within a specific range
def generate_random_dates(start_date, end_date, num_dates):
    start_timestamp = start_date.timestamp()
    end_timestamp = end_date.timestamp()
    random_timestamps = [random.uniform(start_timestamp, end_timestamp) for _ in range(num_dates)]
    random_dates = [datetime.fromtimestamp(ts) for ts in random_timestamps]
    return random_dates

# Generate random dates and fees
dates = generate_random_dates(start_date, end_date, num_transactions)
fees = [random.randint(2000, 5000) for _ in range(num_transactions)]  # Random fees between 2000 and 5000

# Create the DataFrame
transactions_df = pd.DataFrame({
    'date': dates,
    'fee': fees
})

# Ensure the date column is in datetime format
transactions_df['date'] = pd.to_datetime(transactions_df['date'])
transactions_df['fee'] = fees = [np.random.randint(2000, 5000) for _ in range(num_transactions)]

# Display the first few rows of the DataFrame
print(transactions_df)

# Optionally, save to a CSV file
# transactions_df.to_csv('transactions_data.csv', index=False)

                          date   fee
0   2023-10-04 10:56:13.373645  3516
1   2023-04-08 14:03:41.286576  3549
2   2023-06-30 23:33:43.611382  3423
3   2023-10-07 22:50:10.109377  4522
4   2023-04-14 07:33:02.602140  2861
..                         ...   ...
995 2023-01-04 20:52:30.707419  2634
996 2023-09-09 18:13:02.980338  2511
997 2023-12-27 00:04:23.073968  4729
998 2023-08-19 14:27:38.932160  2286
999 2023-05-16 03:41:58.127136  3658

[1000 rows x 2 columns]

In [49]:
pd.cut(transactions_df.fee,
                [1,500,1000,3000,5000])

0      (3000, 5000]
1      (3000, 5000]
2      (3000, 5000]
3      (3000, 5000]
4      (1000, 3000]
           ...
995    (1000, 3000]
996    (1000, 3000]
997    (3000, 5000]
998    (1000, 3000]
999    (3000, 5000]
Name: fee, Length: 1000, dtype: category
Categories (4, interval[int64, right]): [(1, 500] < (500, 1000] < (1000, 3000] < (3000, 5000]]

In [73]:
transactions_df.fee.value_counts(normalize= True) # main chwal mari a

fee
4779    0.003
4422    0.003
3678    0.003
4953    0.003
2444    0.003
        ...
3854    0.001
4003    0.001
4984    0.001
2478    0.001
3658    0.001
Name: proportion, Length: 854, dtype: float64

In [74]:
pd.cut(transactions_df.fee,
                [1,500,1000,3000,5000]).value_counts(normalize=True)*100

fee
(3000, 5000]    67.5
(1000, 3000]    32.5
(1, 500]         0.0
(500, 1000]      0.0
Name: proportion, dtype: float64

In [75]:
pd.qcut(transactions_df.fee,[0.3,.5,.7,.9,1])

0                  (3497.5, 4125.0]
1                  (3497.5, 4125.0]
2      (2944.1989999999996, 3497.5]
3                  (4125.0, 4712.1]
4                               NaN
                   ...
995                             NaN
996                             NaN
997                (4712.1, 4996.0]
998                             NaN
999                (3497.5, 4125.0]
Name: fee, Length: 1000, dtype: category
Categories (4, interval[float64, right]): [(2944.1989999999996, 3497.5] < (3497.5, 4125.0] < (4125.0, 4712.1] < (4712.1, 4996.0]]

In [76]:
pd.qcut(transactions_df.fee,[0.3,.5,.7,.9,1]).value_counts()

fee
(3497.5, 4125.0]                201
(2944.1989999999996, 3497.5]    200
(4125.0, 4712.1]                199
(4712.1, 4996.0]                100
Name: count, dtype: int64

In [77]:
pd.qcut(transactions_df.fee,[0.3,.5,.7,.9,1]).value_counts(normalize=True)*100

fee
(3497.5, 4125.0]                28.714286
(2944.1989999999996, 3497.5]    28.571429
(4125.0, 4712.1]                28.428571
(4712.1, 4996.0]                14.285714
Name: proportion, dtype: float64

In [78]:
students_df.head()

   roll_no   name father     course date_of_admission    fee
0        1  Alice    Bob    Physics        2023-01-10  10000
1        2  Brian  Steve  Chemistry        2023-02-12  11000
2        3  Chloe    Tim    Biology        2023-03-14  12000
3        4  David   Rick    Physics        2023-04-10  13000
4        5    Eva   John    Physics        2023-05-16  14000

# filter on columns
* & , | , ~
syntax :
```
dataframe[(dataframe.column1=='value1') & (dataframe.column=='value2')]
```
* string column
* numeric columns
* datetime columns

In [110]:
import pandera as pa
from pandera.typing import DataFrame, Series
from datetime import datetime
import pandas as pd

# Define the schema using DataFrameSchema
schema = pa.DataFrameSchema({
    'roll_no': pa.Column(pa.Int, checks=pa.Check.ge(1)),
    'name': pa.Column(pa.String, nullable=False),
    'father': pa.Column(pa.String, nullable=False),
    'course': pa.Column(pa.String, nullable=False),
    'date_of_admission': pa.Column(pa.DateTime, checks=pa.Check.le(datetime.now())),
    'fee': pa.Column(pa.Int, checks=pa.Check.ge(0))
})

# Data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'computer', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# Create the DataFrame
students_df = pd.DataFrame(students_data)

# Convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# Validate the DataFrame
validated_df = schema.validate(students_df)

print(validated_df)

TypeError: 'Series' object is not callable

In [79]:
students_df.head(10)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah   computer        2023-10-05  19000

In [106]:
students_df[students_df['course']=='Physics']

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000
3        4  David   Rick  Physics        2023-04-10  13000
4        5    Eva   John  Physics        2023-05-16  14000

In [112]:
students_df[students_df['course'] =='Physics']

   roll_no   name father   course date_of_admission    fee
3        4  David   Rick  Physics        2023-04-10  13000
4        5    Eva   John  Physics        2023-05-16  14000

In [114]:
students_df[students_df['course'].str.lower() =='physics']

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  physics        2023-01-10  10000
3        4  David   Rick  Physics        2023-04-10  13000
4        5    Eva   John  Physics        2023-05-16  14000